// なかまづくりが失敗する相手の特性
var entrainment_enemy_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'なまけ', 
    'バトルスイッチ', 
    'ばけのかわ', 
    'マルチタイプ', 
    'リミットシールド'
]

// なかまづくりが失敗する自分の特性
var entrainment_self_ability_list = [
    'アイスフェイス', 
    'イリュージョン', 
    'うのミサイル', 
    'かがくのちから', 
    'かがくへんかガス', 
    'かわりもの', 
    'じんばいったい', 
    'ダルマモード', 
    'てんきや', 
    'トレース', 
    'ばけのかわ', 
    'はらぺこスイッチ', 
    'フラワーギフト', 
    'レシーバー'
]

// いえきが失敗する相手の特性
var gastro_acid_enemy_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'マルチタイプ', 
    'リミットシールド'
]

// なりきりが失敗する相手の特性
var role_play_enemy_ability_list = [
    'てんきや', 
    'トレース', 
    'ふしぎなまもり', 
    'フラワーギフト', 
    'マルチタイプ', 
    'イリュージョン', 
    'かわりもの', 
    'ダルマモード', 
    'バトルスイッチ', 
    'ARシステム', 
    'かがくのちから', 
    'きずなへんげ', 
    'ぎょぐん', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ばけのかわ', 
    'リミットシールド', 
    'レシーバー', 
    'アイスフェイス', 
    'じんばいったい', 
    'はらぺこスイッチ', 
    'うのミサイル', 
    'かがくへんかガス'
]

// なりきりが失敗する自分の特性
var role_play_self_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'はらぺこスイッチ', 
    'マルチタイプ', 
    'リミットシールド'
]

// シンプルビームが失敗する相手の特性
var simple_beam_enemy_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'なまけ', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'マルチタイプ', 
    'リミットシールド'
]

// なやみのタネが失敗する相手の特性
var worry_seed_enemy_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'なまけ', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'マルチタイプ', 
    'リミットシールド'
]

// どちらかが当てはまればスキルスワップが失敗する特性
var skill_swap_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'イリュージョン', 
    'うのミサイル', 
    'かがくへんかガス', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'はらぺこスイッチ', 
    'ふしぎなまもり', 
    'マルチタイプ', 
    'リミットシールド'
]

// ミイラが失敗する自分の特性
var mummy_self_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'きずなへんげ', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'マルチタイプ', 
    'リミットシールド'
]

// さまようたましいが失敗する自分の特性
var wandering_spirit_self_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'イリュージョン', 
    'うのミサイル', 
    'かがくへんかガス', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ', 
    'はらぺこスイッチ', 
    'ふしぎなまもり'
]

// かがくへんかガスにより発動しなくなる特性：これら以外
exports.neutralizing = function(){
    return neutralizing_gas_ability_list
}
var neutralizing_gas_ability_list = [
    'ARシステム', 
    'アイスフェイス', 
    'うのミサイル', 
    'かがくへんかガス', 
    'ぎょぐん', 
    'じんばいったい', 
    'スワームチェンジ', 
    'ダルマモード', 
    'ばけのかわ', 
    'バトルスイッチ'
]

// かがくへんかガスの発動により無効になる特性
var neutralizing_gas_invalidation_ability_list = [
    'イリュージョン', 
    'かわりもの', 
    'なまけ', 
    'はらぺこスイッチ', 
    'ふしぎなまもり', 
    'フラワーギフト'
]

// トレースが失敗する特性
exports.trace = function(){
    return trace_ability_list
}
var trace_ability_list = [
    'てんきや', 
    'トレース', 
    'フラワーギフト', 
    'マルチタイプ', 
    'イリュージョン', 
    'かわりもの', 
    'ダルマモード', 
    'バトルスイッチ', 
    'ARシステム', 
    'かがくのちから', 
    'きずなへんげ', 
    'ぎょぐん', 
    'スワームチェンジ', 
    'ぜったいねむり', 
    'ばけのかわ', 
    'リミットシールド',
    'レシーバー', 
    'アイスフェイス', 
    'うのミサイル', 
    'かがくへんかガス', 
    'じんばいったい', 
    'はらぺこスイッチ'
]
